第二轮测试截图/SGRT00-广东烟草/广东烟草查询清算金额-483813/广东省烟草查询清算金额测试数据.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://gdeupsb.service.bankcomm.com/basic/atomic/operation.GDEUPSBTbcService/Schema" xmlns:gsp="http://gsp.bankcomm.com" xmlns:bbip="http://bbip.bankcomm.com">
   <soapenv:Body>
      <sch:qryClearAccountAction>
         <gsp:requestInformation>
            <gsp:traceNo>1</gsp:traceNo>
            <gsp:version>1</gsp:version>
            <!--Optional:-->
            <gsp:traceSrc>1</gsp:traceSrc>
         </gsp:requestInformation>
         <sch:request>
            <sch:requestHeader>
               <bbip:bbipRequestHead>
                  <!--Optional:-->
                  <bbip:txnCde>1</bbip:txnCde>
                  <bbip:chn>1</bbip:chn>
                  <!--Optional:-->
                  <bbip:reqSysCde>1</bbip:reqSysCde>
                  <!--Optional:-->
                  <bbip:subSysCde>1</bbip:subSysCde>
                  <!--Optional:-->
                  <bbip:bbipBusCde>1</bbip:bbipBusCde>
                  <bbip:reqJrnNo>1</bbip:reqJrnNo>
                  <bbip:tlr>ABIR148</bbip:tlr>
                  <bbip:br>01441131999</bbip:br>
                  <bbip:bk>01441999999</bbip:bk>
                  <!--Optional:-->
                  <bbip:tlrTmlId>1</bbip:tlrTmlId>
                  <!--Optional:-->
                  <bbip:reqTyp>1</bbip:reqTyp>
                  <!--Optional:-->
                  <bbip:authLvl>?</bbip:authLvl>
                  <!--Optional:-->
                  <bbip:sup1Id>1</bbip:sup1Id>
                  <!--Optional:-->
                  <bbip:sup1Auth>1</bbip:sup1Auth>
                  <!--Optional:-->
                  <bbip:sup2Id>1</bbip:sup2Id>
                  <!--Optional:-->
                  <bbip:sup2Auth>1</bbip:sup2Auth>
                  <!--Optional:-->
                  <bbip:authResnTbl>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                  </bbip:authResnTbl>
                  <!--Optional:-->
                  <bbip:authLog>1</bbip:authLog>
                  <!--Optional:-->
                  <bbip:filler>1</bbip:filler>
                  <bbip:reqTme>2015-03-12T12:12:12</bbip:reqTme>
               </bbip:bbipRequestHead>
            </sch:requestHeader>
            <sch:eupsBusTyp>SGRT00</sch:eupsBusTyp>
            <sch:dptId>2008</sch:dptId>
            <sch:txnDat>2015-03-12</sch:txnDat>
         </sch:request>
      </sch:qryClearAccountAction>
   </soapenv:Body>
</soapenv:Envelope>